# Задача 2: Найдите сумму цифр трехзначного числа.
# Примеры:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
a = int(input("Введите число: "))
x = a % 10
b = a // 100
c = (a//10)%10
y = x +b+c
print(y)


# n = int(input("Введите число: "))
 
# suma = 0
 
# while n > 0:
#     digit = n % 10
#     suma = suma + digit
#     n = n // 10
 
# print("Сумма:", suma)