# 2. Дано натуральное число A > 1. Определите, каким по счету числом Фибоначчи оно является, 
# то есть выведите такое число n, что φ(n)=A. 
# Если А не является числом Фибоначчи, выведите число -1.
# 1 1 2 3 5 8
# 5 -> 5
# 8 -> 6
# 7 -> -1

# a = int(input("Введите число: "))
# i = 0
# f1 = 1
# f2 = 1
# while i < a-2:
#     sum = f1 + f2
#     f1 = f2
#     f2 = sum
#     i += 1
# print(i)

n = int(input('n: '))
f_1 = 1
f_2 = 1
num_index = 2

while f_2 < n:
    num_index += 1
    f_1, f_2 = f_2, f_1 + f_2
    
if f_2 == n:
    print(num_index)
else:
    print(-1)
    
print(num_index if f_2 == n else -1)